ChibiOS/ChibiOS/os/hal/ports/STM32/STM32H5xx/hal_lld.h
/*
    ChibiOS - Copyright (C) 2006..2018 Giovanni Di Sirio

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/

/**
 * @file    STM32H5xx/hal_lld.h
 * @brief   STM32H5xx HAL subsystem low level driver header.
 * @pre     This module requires the following macros to be defined in the
 *          @p board.h file:
 *          - STM32_LSECLK.
 *          - STM32_LSEDRV.
 *          - STM32_LSE_BYPASS (optionally).
 *          - STM32_HSECLK.
 *          - STM32_HSE_BYPASS (optionally).
 *          .
 *          One of the following macros must also be defined:
 *          - STM32H503xx.
 *          - STM32H562xx, STM32H563xx, STM32H573xx.
 *          .
 *
 * @addtogroup HAL
 * @{
 */

#ifndef HAL_LLD_H
#define HAL_LLD_H

#include "stm32_registry.h"

/*===========================================================================*/
/* Driver constants.                                                         */
/*===========================================================================*/

/**
 * @brief   Requires use of SPIv2 driver model.
 */
#define HAL_LLD_SELECT_SPI_V2           TRUE

/**
 * @name    Platform identification
 * @{
 */
#if defined(STM32H503xx) || defined(__DOXYGEN__)
#define PLATFORM_NAME           "STM32H5 High-performance"

#elif defined(STM32H562xx) || defined(STM32H563xx)
#define PLATFORM_NAME           "STM32H5 High-performance"

#elif defined(STM32H573xx)
#define PLATFORM_NAME           "STM32H5 High-performance with security"

#else
#error "STM32H5 device not specified"
#endif

/**
 * @brief   Sub-family identifier.
 */
#if !defined(STM32H5XX) || defined(__DOXYGEN__)
#define STM32H5XX
#endif
/** @} */

/**
 * @name   Clock points names
 * @{
 */
#define CLK_SYSCLK              0U
#define CLK_PLL1PCLK            1U
#define CLK_PLL1QCLK            2U
#define CLK_PLL1RCLK            3U
#define CLK_PLL2PCLK            4U
#define CLK_PLL2QCLK            5U
#define CLK_PLL2RCLK            6U
#define CLK_PLL3PCLK            7U
#define CLK_PLL3QCLK            8U
#define CLK_PLL3RCLK            9U
#define CLK_HCLK                10U
#define CLK_PCLK1               11U
#define CLK_PCLK1TIM            12U
#define CLK_PCLK2               13U
#define CLK_PCLK2TIM            14U
#define CLK_MCO1                15U
#define CLK_MCO2                16U
#define CLK_LSCO                17U
#define CLK_ARRAY_SIZE          18U
/** @} */

/**
 * @name    VOS field definitions
 * @{
 */
#define STM32_VOS_MASK          (3U << 14)  /**< Core voltage mask.         */
#define STM32_VOS_RANGE3        (0U << 14)  /**< Core voltage 1 Volt.       */
#define STM32_VOS_RANGE2        (1U << 14)  /**< Core voltage 1.1 Volts.    */
#define STM32_VOS_RANGE1        (2U << 14)  /**< Core voltage 1.2 Volts.    */
#define STM32_VOS_RANGE0        (3U << 14)  /**< Core voltage 1.35 Volts.   */
/** @} */

/**
 * @name    RCC_CFGR1 register bits definitions
 * @{
 */
#define STM32_SW_MASK           (3U << 0)
#define STM32_SW_FIELD(n)       ((n) << 0)
#define STM32_SW_HSI            STM32_SW_FIELD(1U)
#define STM32_SW_CSI            STM32_SW_FIELD(2U)
#define STM32_SW_HSE            STM32_SW_FIELD(2U)
#define STM32_SW_PLL1PCLK       STM32_SW_FIELD(3U)

#define STM32_MCO1SEL_MASK      (7U << 22)
#define STM32_MCO1PRE_FIELD(n)  ((n) << 22)
#define STM32_MCO1SEL_HSI       STM32_MCO1PRE_FIELD(0U)
#define STM32_MCO1SEL_LSE       STM32_MCO1PRE_FIELD(1U)
#define STM32_MCO1SEL_HSE       STM32_MCO1PRE_FIELD(2U)
#define STM32_MCO1SEL_PLL1P     STM32_MCO1PRE_FIELD(3U)
#define STM32_MCO1SEL_HSI48     STM32_MCO1PRE_FIELD(4U)

#define STM32_MCO1PRE_MASK      (7U << 18)
#define STM32_MCO1PRE_FIELD(n)  ((n) << 18)
#define STM32_MCO1PRE_DISABLED  STM32_MCOPRE_FIELD(0U)
#define STM32_MCO1PRE_DIV1      STM32_MCOPRE_FIELD(1U)
#define STM32_MCO1PRE_DIV2      STM32_MCOPRE_FIELD(2U)
#define STM32_MCO1PRE_DIV3      STM32_MCOPRE_FIELD(3U)
#define STM32_MCO1PRE_DIV4      STM32_MCOPRE_FIELD(4U)
#define STM32_MCO1PRE_DIV5      STM32_MCOPRE_FIELD(5U)
#define STM32_MCO1PRE_DIV6      STM32_MCOPRE_FIELD(6U)
#define STM32_MCO1PRE_DIV7      STM32_MCOPRE_FIELD(7U)
#define STM32_MCO1PRE_DIV8      STM32_MCOPRE_FIELD(8U)
#define STM32_MCO1PRE_DIV9      STM32_MCOPRE_FIELD(9U)
#define STM32_MCO1PRE_DIV10     STM32_MCOPRE_FIELD(10U)
#define STM32_MCO1PRE_DIV11     STM32_MCOPRE_FIELD(11U)
#define STM32_MCO1PRE_DIV12     STM32_MCOPRE_FIELD(12U)
#define STM32_MCO1PRE_DIV13     STM32_MCOPRE_FIELD(13U)
#define STM32_MCO1PRE_DIV14     STM32_MCOPRE_FIELD(14U)
#define STM32_MCO1PRE_DIV15     STM32_MCOPRE_FIELD(15U)

#define STM32_MCO2SEL_MASK      (7U << 29)
#define STM32_MCO2PRE_FIELD(n)  ((n) << 29)
#define STM32_MCO2SEL_SYSCLK    STM32_MCO2PRE_FIELD(0U)
#define STM32_MCO2SEL_PLL2P     STM32_MCO2PRE_FIELD(1U)
#define STM32_MCO2SEL_HSE       STM32_MCO2PRE_FIELD(2U)
#define STM32_MCO2SEL_PLL1P     STM32_MCO2PRE_FIELD(3U)
#define STM32_MCO2SEL_CSI       STM32_MCO2PRE_FIELD(4U)
#define STM32_MCO2SEL_LSI       STM32_MCO2PRE_FIELD(5U)

#define STM32_MCO2PRE_MASK      (7U << 18)
#define STM32_MCO2PRE_FIELD(n)  ((n) << 18)
#define STM32_MCO2PRE_DISABLED  STM32_MCO2PRE_FIELD(0U)
#define STM32_MCO2PRE_DIV1      STM32_MCO2PRE_FIELD(1U)
#define STM32_MCO2PRE_DIV2      STM32_MCO2PRE_FIELD(2U)
#define STM32_MCO2PRE_DIV3      STM32_MCO2PRE_FIELD(3U)
#define STM32_MCO2PRE_DIV4      STM32_MCO2PRE_FIELD(4U)
#define STM32_MCO2PRE_DIV5      STM32_MCO2PRE_FIELD(5U)
#define STM32_MCO2PRE_DIV6      STM32_MCO2PRE_FIELD(6U)
#define STM32_MCO2PRE_DIV7      STM32_MCO2PRE_FIELD(7U)
#define STM32_MCO2PRE_DIV8      STM32_MCO2PRE_FIELD(8U)
#define STM32_MCO2PRE_DIV9      STM32_MCO2PRE_FIELD(9U)
#define STM32_MCO2PRE_DIV10     STM32_MCO2PRE_FIELD(10U)
#define STM32_MCO2PRE_DIV11     STM32_MCO2PRE_FIELD(11U)
#define STM32_MCO2PRE_DIV12     STM32_MCO2PRE_FIELD(12U)
#define STM32_MCO2PRE_DIV13     STM32_MCO2PRE_FIELD(13U)
#define STM32_MCO2PRE_DIV14     STM32_MCO2PRE_FIELD(14U)
#define STM32_MCO2PRE_DIV15     STM32_MCO2PRE_FIELD(15U)
/** @} */

/**
 * @name    RCC_PLLCFGR register bits definitions
 * @{
 */
#define STM32_PLLSRC_MASK       (3 << 0)    /**< PLL clock source mask.     */
#define STM32_PLLSRC_NOCLOCK    (0 << 0)    /**< PLL clock source disabled. */
#define STM32_PLLSRC_HSI16      (2 << 0)    /**< PLL clock source is HSI16. */
#define STM32_PLLSRC_HSE        (3 << 0)    /**< PLL clock source is HSE.   */
/** @} */

/**
 * @name    RCC_CCIPR register bits definitions
 * @{
 */
#define STM32_USART1SEL_MASK    (3U << 0U)  /**< USART1SEL mask.            */
#define STM32_USART1SEL_PCLK2   (0U << 0U)  /**< USART1 source is PCLK2.    */
#define STM32_USART1SEL_SYSCLK  (1U << 0U)  /**< USART1 source is SYSCLK.   */
#define STM32_USART1SEL_HSI16   (2U << 0U)  /**< USART1 source is HSI16.    */
#define STM32_USART1SEL_LSE     (3U << 0U)  /**< USART1 source is LSE.      */

